app/controllers/api/prices_controller.rb

SELECT "prices".* FROM "prices" WHERE (symbol IN ('BTCAUD','ETHAUD')) ORDER BY "prices"."timestamp" DESC
---
      def index
        @prices = Price.where("symbol IN (?,?)", 'BTCAUD', 'ETHAUD').order(timestamp: :desc)