app/controllers/prices_controller.rb

  def history
    @price = Price.find(params[:id])
    if @price.symbol == 'BTCAUD'
      @prices = Price.where(symbol: 'BTCAUD').order(timestamp: :desc)
---
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "prices".* FROM "prices" WHERE "prices"."symbol" = ? ORDER BY "prices"."timestamp" DESC  [["symbol", "BTCAUD"]]

  def edit
    @price = Price.find(params[:id])
---
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    @price = Price.find(params[:id])
    if @price.update(price_params)
---
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "prices" SET "last" = ?, "updated_at" = ? WHERE "prices"."id" = ?  [["last", 12345.0], ["updated_at", "2024-04-23 05:17:05.382636"], ["id", 1]]

  def show
    @price = Price.find(params[:id])
---
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def destroy
    @price = Price.find(params[:id])
    if @price.destroy
---
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "prices" WHERE "prices"."id" = ?  [["id", 1]]